app/Controllers/user.php

INSERT INTO `catatan` (`Tanggal`, `Jam`, `LokasiBerkunjung`, `SuhuTubuh`) VALUES ('2023-01-17', '14:22', 'jakarta', '36')
---
    public function simpan_catatan()
    {
        $catatan = new Catatan();
        $tanggal = $this->request->getVar('tanggal');
        $jam = $this->request->getVar('jam');
        $lokasi = $this->request->getVar('lokasi');
        $suhu = $this->request->getVar('suhu');
        $nama = session('nama');
        $nik = session('nik');
        $data = [
          'Tanggal' => $tanggal,
          'Jam' => $jam,
          'LokasiBerkunjung' => $lokasi ,
          'SuhuTubuh' => $suhu,
        ];

        $catatan->save($data);

SELECT *
FROM `catatan`
---
    public function riwayat()
    {
        if (session('nik') == NULL) {
        return redirect()->to(base_url('login'));
        } else {
        // $data = [
        // 'data' => file('catatan.txt', FILE_IGNORE_NEW_LINES)
        // ];
        $perjalanan = new Catatan();
        $perjalanan = $perjalanan->findAll();